# Human Resources - SQL project

## Alondra Perez Cortez

## 2022-11-03

### **Introduction**

This is my first SQL project where I will be demonstrating beginning to intermediate SQL skills using Microsoft SQL and SQLite. I first wrote my script in SQLite Studio, but found myself troubled with how to share my finished document in an elegant manner. I like the look of notebooks, but there are not a lot of options for SQLite and Mac users like myself. However, I found a really great [youtube video](https://www.youtube.com/watch?v=glxE7w4D8v8) that taught me how to add MS SQL to my Mac. So I went back to my script and edited it for MS SQL, but left my SQLite script in at the bottom of this page.

If you have any question, please feel free to email me at apcalondraperezcortez (at) gmail.com or via [LinkedIn](https://www.linkedin.com/in/alondra-perez-cortez/). If you want to check out more of my work, please visit my [portfolio](https://sites.google.com/view/alondra-perez-cortez/projects).

### <span style="font-size: 14px;"><b>Project Overview</b></span>

<span style="font-size: 14px;">For this project, I am using a&nbsp;</span> [sample SQL database](https://www.sqltutorial.org/sql-sample-database/) <span style="font-size: 14px;">&nbsp;that manages HR data of a small buisness. I have included a variety of queries — some simple, some more complex and practical, and others that are just outlandish.&nbsp;</span> I will be walking you through beginning to intermediate SQL queries: `JOIN`, `UPDATE`, `MINUS`, subqueries, temporary tables, and recursive queries to name a few tools used in this project.

### **Database Structure**

![Image of database structure](https://www.sqltutorial.org/wp-content/uploads/2016/04/SQL-Sample-Database-Schema.png))

_Basic filtering_

1\. Find employees whose salary is less than $6,000. Return their full name and salary.

In [4]:
SELECT CONCAT(first_name, ' ', last_name) AS full_name, salary
FROM employees
WHERE salary < 6000

full_name,salary
David Austin,4800.00
Valli Pataballa,4800.00
Diana Lorentz,4200.00
Alexander Khoo,3100.00
Shelli Baida,2900.00
Sigal Tobias,2800.00
Guy Himuro,2600.00
Karen Colmenares,2500.00
Irene Mikkilineni,2700.00
Sarah Bell,4000.00
Britney Everett,3900.00
Jennifer Whalen,4400.00

2\. Find employees who were hired after 1997-09-01. Return their full name and hire date.

In [2]:
SELECT CONCAT(first_name, ' ', last_name) AS full_name, hire_date
FROM employees
WHERE hire_date > '1997-09-01'

full_name,hire_date
Valli Pataballa,1998-02-05
Diana Lorentz,1999-02-07
John Chen,1997-09-28
Ismael Sciarra,1997-09-30
Jose Manuel Urman,1998-03-07
Luis Popp,1999-12-07
Shelli Baida,1997-12-24
Guy Himuro,1998-11-15
Karen Colmenares,1999-08-10
Shanta Vollman,1997-10-10
Irene Mikkilineni,1998-09-28
Jonathon Taylor,1998-03-24
Jack Livingston,1998-04-23
Kimberely Grant,1999-05-24
Charles Johnson,2000-01-04

_Altering tables_

3. Create a new column in 'employees' for full name

In [8]:
ALTER TABLE [master].[dbo].[employees]
ADD full_name TEXT

In [11]:
UPDATE [master].[dbo].[employees]
SET full_name = CONCAT(employees.first_name, ' ', employees.last_name)

SELECT TOP (3) employee_id, first_name, last_name, full_name
FROM employees

employee_id,first_name,last_name,full_name
100,Steven,King,Steven King
101,Neena,Kochhar,Neena Kochhar
102,Lex,De Haan,Lex De Haan

_Filtering and Joining_

4. What job titles are within the Finance department?

In [13]:
--What is the department ID for the Finance department?
SELECT *
FROM departments
WHERE department_name = 'Finance'
--The department_id for Finance is 10.

department_id,department_name,location_id
10,Finance,1700

In [14]:
--METHOD 1, simple queries
--Find all job_id's for everyone in the Finance department
SELECT DISTINCT(job_id)
FROM employees
WHERE department_id = 10
--7 and 6 are the two job_id's within the Finance department

--Find the job titles for job_id's 7 and 6
SELECT job_title AS finance_jobs
FROM jobs
WHERE job_id = 7 OR job_id = 6
-- Accountant and Finance Manager are the two titles held in the Finance department

job_id
6
7

finance_jobs
Accountant
Finance Manager

In [15]:
--METHOD 2, join
SELECT DISTINCT(jobs.job_title) AS finance_jobs
FROM employees
JOIN jobs ON employees.job_id = jobs.job_id
WHERE employees.department_id = 10

finance_jobs
Accountant
Finance Manager

5\. Which employees have first names OR last names that do not start with the letters 'D' or 'S'? Return their hire date, salary, and department.

In [16]:
SELECT employees.full_name, employees.hire_date, employees.salary, departments.department_name
FROM employees
JOIN departments on employees.department_id = departments.department_id
WHERE employees.first_name NOT LIKE '%D%' AND
        employees.first_name NOT LIKE '%S%' AND
        employees.last_name NOT LIKE '%D%' AND
        employees.last_name NOT LIKE '%S%'

full_name,hire_date,salary,department_name
Neena Kochhar,1989-09-21,17000.00,Executive
Valli Pataballa,1998-02-05,4800.00,IT
Nancy Greenberg,1994-08-17,12000.00,Finance
John Chen,1997-09-28,8200.00,Finance
Guy Himuro,1998-11-15,2600.00,Purchasing
Payam Kaufling,1995-05-01,7900.00,Shipping
Irene Mikkilineni,1998-09-28,2700.00,Shipping
Jonathon Taylor,1998-03-24,8600.00,Sales
Kimberely Grant,1999-05-24,7000.00,Sales
Britney Everett,1997-03-03,3900.00,Shipping
Jennifer Whalen,1987-09-17,4400.00,Administration
Pat Fay,1997-08-17,6000.00,Marketing
Hermann Baer,1994-06-07,10000.00,Public Relations
William Gietz,1994-06-07,8300.00,Accounting

_Grouping_

6\. Which location has the most employees?

In [12]:
--Which is the biggest department?
SELECT TOP 1 E.department_id, D.department_name, COUNT(*) AS employee_count
FROM employees E
JOIN departments D
ON E.department_id = D.department_id
GROUP BY E.department_id, D.department_name
ORDER BY employee_count DESC
--The Shipping department has the most employees at 7 employees

--Where is the biggest department?
SELECT D.department_name, L.city, L.country_id
FROM departments D
JOIN locations L ON D.location_id = L.location_id
WHERE department_id = 5
--Shipping in South San Francisco, US is the largest department

department_id,department_name,employee_count
5,Shipping,7

department_name,city,country_id
Shipping,South San Francisco,US

7\. Which department has the most managers?

In [28]:
SELECT TOP 1 E.department_id, D.department_name, COUNT(DISTINCT(E.manager_id)) manager_count
FROM employees E
JOIN departments D ON E.department_id = D.department_id
GROUP BY E.department_id, D.department_name
ORDER BY manager_count DESC

department_id,department_name,manager_count
5,Shipping,3

_Temporary Table_

8\. What are the new salaries of all employees, based on their titles?

In [35]:
DROP TABLE IF EXISTS #raises

SELECT job_id, job_title,
    (CASE
        WHEN [job_title] LIKE '%President%' OR
            [job_title] LIKE '%Manager%'
            THEN 0.05
        ELSE 0.03 END) AS percent_inc
INTO #raises
FROM jobs

SELECT TOP 3 E.employee_id, E.full_name, E.job_id, E.salary AS old_salary, R.percent_inc, (E.salary + E.salary*R.percent_inc) AS new_salary
FROM employees E
JOIN #raises R ON E.job_id = R.job_id

employee_id,full_name,job_id,old_salary,percent_inc,new_salary
206,William Gietz,1,8300.00,0.03,8549.0000
205,Shelley Higgins,2,12000.00,0.05,12600.0000
200,Jennifer Whalen,3,4400.00,0.03,4532.0000

_Recursive Queries_

9\. Find the hierarchy of employees under a given manager "Neena Kochhar"

In [38]:
WITH emp_hierarchy AS
    (SELECT employee_id, full_name, manager_id, job_id, 1 as level
    FROM employees WHERE first_name = 'Neena'
    UNION ALL
    SELECT E.employee_id, E.full_name, E.manager_id, E.job_id, H.level + 1 AS level
    FROM emp_hierarchy H
    JOIN employees E ON H.employee_id = E.manager_id)
SELECT H2.employee_id, H2.full_name AS employee_name, E2.full_name AS manager_name, H2.level AS level
FROM emp_hierarchy H2
JOIN employees E2 ON E2.employee_id = H2.manager_id

employee_id,employee_name,manager_name,level
101,Neena Kochhar,Steven King,1
108,Nancy Greenberg,Neena Kochhar,2
200,Jennifer Whalen,Neena Kochhar,2
203,Susan Mavris,Neena Kochhar,2
204,Hermann Baer,Neena Kochhar,2
205,Shelley Higgins,Neena Kochhar,2
206,William Gietz,Shelley Higgins,3
109,Daniel Faviet,Nancy Greenberg,3
110,John Chen,Nancy Greenberg,3
111,Ismael Sciarra,Nancy Greenberg,3
112,Jose Manuel Urman,Nancy Greenberg,3
113,Luis Popp,Nancy Greenberg,3

_CTE_

10\. Which employees do not have dependents?

In [39]:
WITH dependentless AS (
    SELECT employee_id
    FROM employees
    EXCEPT
    SELECT employee_id
    FROM dependents)
SELECT D.employee_id, E.full_name
FROM dependentless D
JOIN employees E ON D.employee_id = E.employee_id

employee_id,full_name
120,Matthew Weiss
121,Adam Fripp
122,Payam Kaufling
123,Shanta Vollman
126,Irene Mikkilineni
177,Jack Livingston
178,Kimberely Grant
179,Charles Johnson
192,Sarah Bell
193,Britney Everett

## Original SQLite Script

\--FILTERING

\--1. Find employees whose salary is less than $6,000. Return their full name and salary

SELECT first\_name || " " || last\_name AS full\_name, salary

FROM employees

WHERE salary \< 6000

  

  

\--2. Find employees who were hired after 1997-09-01. Return their full name and hire date.

SELECT first\_name || " " || last\_name AS full\_name, hire\_date

FROM employees

WHERE hire\_date \> date('1997-09-01')

  

  

\--ALTERING TABLES

\--3. Create a new column in 'employees' for full name

ALTER TABLE employees

ADD full\_name TEXT

UPDATE employees

SET full\_name = employees.first\_name || " " || employees.last\_name

  

  

\--FILTERING AND JOINNING

\--4. What job titles are within the Finance department?

\--What is the deparmtent ID for the Finance department?

SELECT \*

FROM departments

WHERE department\_name = "Finance"

\--The department\_id for Finance is 10.

  

\--METHOD 1, simple queries

\--Find all job\_id's for everyone in the Finance department

SELECT DISTINCT(job\_id)

FROM employees

WHERE department\_id = 10

\--7 and 6 are the two job\_id's within the Finance department

  

\--Find the job titles for job\_id's 7 and 6

SELECT job\_title AS finance\_jobs

FROM jobs

WHERE job\_id = 7 OR job\_id = 6

\-- Accountant and Finance Manager are the two titles held in the Finance department

  

\--METHOD 2, join

SELECT DISTINCT(jobs.job\_title) AS finance\_jobs

FROM employees

JOIN jobs ON employees.job\_id = jobs.job\_id

WHERE employees.department\_id = 10

  

  

\--5. Which employees have first names OR last names that do not start with the letters 'D' or 'S'? When were they hired? What is their salary? What is their department?

SELECT employees.full\_name, employees.hire\_date, employees.salary, departments.department\_name

FROM employees

JOIN departments on employees.department\_id = departments.department\_id

WHERE employees.first\_name NOT LIKE '%D%' AND

employees.first\_name NOT LIKE '%S%' AND

employees.last\_name NOT LIKE '%D%' AND

employees.last\_name NOT LIKE '%S%'

  

  

\--GROUPING

\--6. Which location has the most employees?

\--Which is the biggest department?

SELECT department\_id, MAX(employee\_count)

FROM (SELECT department\_id, COUNT(department\_id) employee\_count

FROM employees

GROUP BY department\_id)

\--Department ID 5 has the most employees at 7 employees

  

\--Where is the biggest department?

SELECT departments.department\_name, locations.city, locations.country\_id

FROM departments

JOIN locations ON departments.location\_id = locations.location\_id

WHERE department\_id = 5

\--Shipping in South San Francisco, US is the largest department

  

  

\--SUBQUERIES

\--7. Which department has the most managers?

SELECT departments.department\_name, MAX(department\_count.manager\_count) manager\_count

FROM (SELECT department\_id, COUNT(DISTINCT(manager\_id)) manager\_count

FROM employees

GROUP BY department\_id) department\_count

JOIN departments ON departments.department\_id = department\_count.department\_id

\--The Shipping department has 3 managers

  

  

\--TEMPORARY TABLES

\--8. What are the new salaries of all employees, based on their titles?

\--assign percentage increase for raise

DROP TABLE IF EXISTS raises

CREATE TEMP TABLE raises AS

SELECT job\_id, job\_title,

(CASE

WHEN \[job\_title\] LIKE "%President%" OR

\[job\_title\] LIKE "%Manager%"

THEN 0.05

ELSE 0.03 END) AS percent\_inc

FROM jobs

  

\--calculate new salary after raise

SELECT E.employee\_id, E.full\_name, E.job\_id, E.salary AS old\_salary, R.percent\_inc, (E.salary + E.salary\*R.percent\_inc) AS new\_salary

FROM employees E

JOIN raises R ON E.job\_id = R.job\_id

  

  

\--RECURSIVE QUERIES

\--9. Find the hierarchy of employees under a given manager "Neena Kochhar"

WITH RECURSIVE emp\_hierarchy AS

(SELECT employee\_id, full\_name, manager\_id, job\_id, 1 as level

FROM employees

WHERE first\_name = "Neena"

UNION

SELECT E.employee\_id, E.full\_name, E.manager\_id, E.job\_id, H.level + 1 AS level

FROM emp\_hierarchy H

JOIN employees E ON H.employee\_id = E.manager\_id)

SELECT H2.employee\_id, H2.full\_name AS employee\_name, E2.full\_name AS manager\_name, H2.level AS level

FROM emp\_hierarchy H2

JOIN employees E2 ON E2.employee\_id = H2.manager\_id

  

  

\--CTE

\--10. Which employees do not have dependents?

WITH dependentless AS (

SELECT employee\_id

FROM employees

EXCEPT

SELECT employee\_id

FROM dependents)

SELECT D.employee\_id, E.full\_name

FROM dependentless D

JOIN employees E ON D.employee\_id = E.employee\_id